# TableMergedCell Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableMergedCell Constructor
TableMergedCell Class See Also
---
Default constructor.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public TableMergedCell()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
TableMergedCell()
```

# See Also
TableMergedCell Class
TableMergedCell Overload
Autodesk.Revit.DB Namespace